#define _CRT_SECURE_NO_WARNINGS 1//相当于“无视风险，继续运行”
#include <stdio.h>
#include<string.h>
#define Zzj 20
enum poteto //enum,创建枚举常量集合，poteto是集合名，格式：enum_名称
{
	ZZJ,//0
	like,//1
	HMH,//2
	verylike//3
};//括号里是不同的枚举常量以及名称
int main()
{
	int zzj = 262610;//变量
	int hmh = 81308;//变量
	int yjx;
	printf("zzj = ");
	scanf("%d", &zzj);
	printf("hmh = ");
	scanf("%d", &hmh);//这里使用scanf,没有出错，也能运行是因为第1行#define _CRT_SECURE_NO_WARINGS 1的屏蔽作用
	//scanf是原C语言提供的函数，而scanf_s是vs编译器提供的，vs编译器当然是用自家的，但使用scanf_s,的代码只能在vs编译器上运行，不通用
	yjx = zzj + hmh;
	printf("zzj + hmh = %d\n", yjx = zzj + hmh);
	//C语言中的常量：字面常量，const修饰的常变量，#define定义的标识符常量，枚举常量。
//#include <stdio.h>
//	int main()
//	{
//		262610;//字面常量，直接写的
//		return 0;
//}
	//而变量是可以变的，例如：
	//int yyl = 252512;
	//printf("%d\n", yyl);
	//yyl = 262610;
	//printf("%d\n", yyl);
	//这里就会分别打印252512和262610
	//如果在int前加const，表示给该变量添加常属性，使其变成常量，但本质上还是变量
	//const int yyl = 252512;这里yyl变成常量，不再变化，强行变化报错。
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//#include<stdio.h>
//	int main()
//	{
//		int zzj = 262610;
//		int arr[zzj] = {0,81308} 这里的中括号表示数组，括号内不能是变量,只能是常量，就算给变量加上const赋予常属性也不行
//		return 0;
//	}
	int arr1[Zzj] = { 0 };//这里Zzj是#define定义标识符常量，我放在开头主函数之外第三行，括号里0的解释在第六十行
	printf("Zzj = %d\n", Zzj);//把常量值借助数组打印出来
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	printf("ZZJ = %d\n", ZZJ);//0
	printf("HMH = %d\n", HMH);//2
	printf("like = %d\n", like);//1
	printf("verylike = %d\n", verylike);//3
	//枚举常量集合也可以放在主函数之外，这里我放在开头第四行
	//运行的结果会按照枚举常量排序从零开始从小到大打印出数字,且值无法改变
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//字符串：一串字符，用双引号定义
	"周尊杰zzj262610#";//这就是字符串的引用
	"";//空字符串，啥也没有，空格也没有
	char arr2[] = "周尊杰zzj262610#";//字符串用字符类型数组保存，数组格式：类型（int,char）_数组名 [] = "字符串";
	printf("%s\n", arr2);
	char arr3[] = { 'a', 'b', 'c'};
	printf("%s\n", arr3);
	//这里arr末尾输出乱码是由于数组输出字符没有以零值结束，如果括号末尾加字符'\0',或者直接加0，不带''就行了
	//数组输出字符串如上五十九行以'周'， '尊'， '杰', 'z'， ...'#', '\0'形式，末尾带字符\0的值为0，表示输出的结束，只不过这里隐藏了
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	printf("%d\n", strlen(arr2));
	printf("%d\n", strlen(arr3));
	//strlen函数，和sizeof差不多，strlen为sting length缩写，用于查看字符串长度,要声明#include<string.h>，不然会有警告
	//这里arr3由于没有0结束，把烫烫烫也算进去了
	printf("%d\n", strlen("c:\test\32\test.c"));//这里面的\t,\32是转义字符，做整体
	printf("%c\n", '\132');//这里\132作八进制132，就是90，对应大写Z,如果是\x61就是十六进制60
	//选择语句（if）
	printf("zzj很帅（是/不是）（1/0）");
	int input;
	scanf("%d", &input);
	if (input == 1)
	{
		printf("你也是\n");
	}
	else
	{
		printf("傻逼\n");
	}
	printf("敲代码\n");
	int i1;
	printf("是否开始修炼（是/否）（1/0）");
	scanf("%d", &i1);
	if (i1 == 1)
	{
		int i2 = 0;
		while (i2 < 999)
		{
			printf("未打通,i = %d\n", i2);
			i2++;
		}
		printf("已打通,i = %d\n", i2);
	
	}
	else
	{
		printf("你完了！\n");
	}
	//创建函数
	int a = 100, b = 200;
	int sum = Add(a, b);//a,b的值发送给x,y
	//接受返回值并赋给sum
	printf("调用函数Add计算结果为：%d\n", sum);
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	char arr4[7] = {'a', 'b', 'c', 'd', 'e', 'f', 'g'};//定义一个数组 数组内数据类型(char) 数据名(arr4) [元素数(7)] = {各个数据元素(abcd...)}
	//数组内各个元素下标为 0，1，2，3，4，5，6
	printf("%c\n", arr4[4]);//这里输出下标为4的e
	return 0;
}
//目前这里位于主函数之外
int Add(int x, int y)//(x,y接收啊，a,b的值)
//int（返回类型） Add（函数名） int x（接受该类型并传输给x）
{
	int z = x + y;
	return z;//返回值（以函数名前的类型返回主函数或者其他函数，发出去）
}//函数体(花括号内）